Revit 2026 API

# RebarContainsValidArcRadiiForStyleAndBarType Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool ContainsValidArcRadiiForStyleAndBarType(
	IList<Curve> curves,
	RebarStyle style,
	RebarBarType barType
)
```
```vb
Public Shared Function ContainsValidArcRadiiForStyleAndBarType (
	curves As IList(Of Curve),
	style As RebarStyle,
	barType As RebarBarType
) As Boolean
```
```cpp
public:
static bool ContainsValidArcRadiiForStyleAndBarType(
	IList<Curve^>^ curves,
	RebarStyle style,
	RebarBarType^ barType
)
```
```fsharp
static member ContainsValidArcRadiiForStyleAndBarType :
        curves : IList<Curve> *
        style : RebarStyle *
        barType : RebarBarType -> bool
```

#### Parameters

curves IListCurve

style RebarStyle

barType RebarBarType

#### Return Value

Boolean

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace